
// -----------------------------------------浏览器错误报告(看图）



// -----------------------------------------错误处理(看图）
// try{
//     jjdj();
// }catch(e){  // e表示接收的错误对象
//     alert(e.name);          // 错误类型
//     alert(e.message);       // 错误信息
// }finally {
//     alert("都执行");
// }

// 错误类型(看图）

// 善用错误(看图）

// 抛出错误(看图）
// try{
//     jjdj();
// }catch(e) {  // e表示接收的错误对象
//     throw "抛出错误";
// }



// -----------------------------------------错误事件(看图）


// -----------------------------------------错误处理策略(看图）


// -----------------------------------------调试技术(看图）


// -----------------------------------------调试工具(看图）
// 使用浏览器的调试功能
var dd = document.getElementById("dd");
dd.onclick = function () {
    this.innerHTML = "llll";

}






