
// ----------------------------DOM类型(看图)
// ----------Node类型(看图)
// ---用于判断对象是什么类型,有一一对应的关系
// window.onload = function (){
//     // alert(Node);
//     // alert(Node.ELEMENT_NODE);
//     // alert(document.nodeType);
// }


// ----------Document类型(看图)
// ---
// ---
// --


// ----------Element类型(看图)
// ---


// ----------Text类型(看图)
// ---有增删查改




// ----------------------------DOM扩展
// ----------呈现模式(看图)
// ---

// ----------滚动(看图)
// 将指定的节点滚动到可见范围内
// ---


// ----------children属性(看图)
// ---

// ----------contains()方法(看图)
// 判读一个节点是不是另一个节点的子节点
// ---


// ----------------------------DOM操作内容(看图)
// ----------
// ---
// ---
// ---
// ---

































































































































